jvisualschool/ESP32-CAM-BenchMark/src/app_httpd.cpp
static esp_err_t pll_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul = parse_get_var(buf, "mul", 0);
  int sys = parse_get_var(buf, "sys", 0);
  int root = parse_get_var(buf, "root", 0);
  int pre = parse_get_var(buf, "pre", 0);
  int seld5 = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, pclken: %d, pclk: %d", bypass, mul, sys, root, pre, seld5, pclken, pclk);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t win_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int startX = parse_get_var(buf, "sx", 0);
  int startY = parse_get_var(buf, "sy", 0);
  int endX = parse_get_var(buf, "ex", 0);
  int endY = parse_get_var(buf, "ey", 0);
  int offsetX = parse_get_var(buf, "offx", 0);
  int offsetY = parse_get_var(buf, "offy", 0);
  int totalX = parse_get_var(buf, "tx", 0);
  int totalY = parse_get_var(buf, "ty", 0);  // codespell:ignore totaly
  int outputX = parse_get_var(buf, "ox", 0);
  int outputY = parse_get_var(buf, "oy", 0);
  bool scale = parse_get_var(buf, "scale", 0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i(
    "Set Window: Start: %d %d, End: %d %d, Offset: %d %d, Total: %d %d, Output: %d %d, Scale: %u, Binning: %u", startX, startY, endX, endY, offsetX, offsetY,
    totalX, totalY, outputX, outputY, scale, binning  // codespell:ignore totaly
  );
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_res_raw(s, startX, startY, endX, endY, offsetX, offsetY, totalX, totalY, outputX, outputY, scale, binning);  // codespell:ignore totaly
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t index_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  sensor_t *s = esp_camera_sensor_get();
  if (s != NULL) {
    if (s->id.PID == OV3660_PID) {
      return httpd_resp_send(req, (const char *)index_ov3660_html_gz, index_ov3660_html_gz_len);
    } else if (s->id.PID == OV5640_PID) {
      return httpd_resp_send(req, (const char *)index_ov5640_html_gz, index_ov5640_html_gz_len);
    } else {
      return httpd_resp_send(req, (const char *)index_ov2640_html_gz, index_ov2640_html_gz_len);
    }
  } else {
    log_e("Camera sensor not found");
    return httpd_resp_send_500(req);
  }
}

static esp_err_t fps_handler(httpd_req_t *req) {
  char buf[32];
  snprintf(buf, sizeof(buf), "%.1f", global_fps);
  httpd_resp_set_type(req, "text/plain");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, buf, strlen(buf));
}

static esp_err_t benchmark_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  const char* html = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <title>ESP32-CAM Benchmark Tool</title>
  <style>
    * { box-sizing: border-box; }
    body { font-family: 'Segoe UI', Tahoma, Geneva, Verdana, sans-serif; background: #121212; color: #fff; margin: 0; padding: 20px; display: flex; flex-direction: column; align-items: center; }
    h1 { margin-bottom: 5px; color: #4CAF50; }
    .container { background: #1e1e1e; padding: 20px; border-radius: 12px; box-shadow: 0 4px 15px rgba(0,0,0,0.5); max-width: 800px; width: 100%; text-align: center; }
    .fps-display { font-size: 4em; font-weight: bold; color: #00e676; margin: 20px 0; }
    img { max-width: 100%; border: 2px solid #333; border-radius: 8px; margin-bottom: 20px; }
    .controls { display: grid; grid-template-columns: 1fr 1fr; gap: 15px; text-align: left; }
    .control-group { background: #2c2c2c; padding: 15px; border-radius: 8px; }
    label { font-size: 0.9em; color: #aaa; margin-bottom: 5px; display: block; }
    select, input[type="range"] { width: 100%; padding: 8px; border-radius: 5px; border: 1px solid #444; background: #222; color: #fff; }
    .btn { background: #4CAF50; color: white; border: none; padding: 10px 15px; border-radius: 5px; cursor: pointer; font-size: 1em; width: 100%; margin-top: 10px; transition: background 0.3s;}
    .btn:hover { background: #45a049; }
    .status { margin-top: 10px; font-size: 0.8em; color: #ffeb3b; }
  </style>
</head>
<body>
  <div class="container">
    <h1>Benchmark Dashboard</h1>
    <p>Optimize your ESP32-CAM performance</p>
    
    <div class="fps-display" id="fps">-- FPS</div>
    
    <!-- Port 81 is stream port -->
    <img id="stream" src="" crossorigin>
    
    <div class="controls">
      <div class="control-group">
        <label>Resolution (Frame Size)</label>
        <select id="framesize" onchange="updateConfig('framesize', this.value)">
          <option value="10">UXGA (1600x1200)</option>
          <option value="9">SXGA (1280x1024)</option>
          <option value="8">XGA (1024x768)</option>
          <option value="7">SVGA (800x600)</option>
          <option value="6">VGA (640x480)</option>
          <option value="5" selected>QVGA (320x240)</option>
          <option value="4">QQVGA (160x120)</option>
          <option value="0">96X96</option>
        </select>
      </div>
      <div class="control-group">
        <label>XCLK Frequency (Boost FPS)</label>
        <select id="xclk" onchange="updateXCLK(this.value)">
          <option value="10">10 MHz</option>
          <option value="12">12 MHz</option>
          <option value="14">14 MHz</option>
          <option value="16">16 MHz</option>
          <option value="18">18 MHz</option>
          <option value="20" selected>20 MHz (Default)</option>
          <option value="22">22 MHz</option>
          <option value="24">24 MHz (High FPS)</option>
        </select>
      </div>
      <div class="control-group">
        <label>JPEG Quality (0-63, Lower = better quality)</label>
        <input type="range" id="quality" min="10" max="63" value="12" onchange="updateConfig('quality', this.value); document.getElementById('qv').innerText=this.value;">
        <div style="font-size:0.8em;text-align:right" id="qv">12</div>
      </div>
      <div class="control-group">
        <label>Actions</label>
        <button class="btn" onclick="startStream()">Restart Stream</button>
        <div class="status" id="statusMsg">Ready.</div>
      </div>
    </div>
  </div>

  <script>
    const streamImg = document.getElementById('stream');
    const fpsElem = document.getElementById('fps');
    const statusMsg = document.getElementById('statusMsg');
    
    function startStream() {
      // Use correct port logic (Stream is usually ServerPort + 1)
      const loc = window.location;
      let streamPort = parseInt(loc.port) + 1;
      if (loc.port === "80" || loc.port === "") streamPort = 81;
      streamImg.src = `${loc.protocol}//${loc.hostname}:${streamPort}/stream?t=${Math.random()}`;
      statusMsg.innerText = "Stream Started.";
    }

    function updateConfig(varName, val) {
      fetch(`/control?var=${varName}&val=${val}`)
        .then(response => {
           if(response.ok) statusMsg.innerText = `${varName} updated to ${val}`;
           else statusMsg.innerText = `Failed to update ${varName}`;
        });
    }

